GuoZhiyong/RTT_GPS_STUSB_TEST/bsp/stm32f40x_production/drivers/mma8451.c
uint8_t				crash_counter = 0;

uint8_t				CTRL_REG1_value			= 0x20; /*00 010 */
uint8_t				PL_BF_ZCOMP_REG_value	= 0xc7;
uint8_t				PL_P_L_THS_REG_vlaue	= 0xcf;


/*
读取
 */

uint8_t	mems_value[3]={0x10,0xc0,0x00};

void EXTI9_5_IRQHandler( void )
{
	uint8_t ret,value1,value2,value3;
	rt_interrupt_enter( );
	if( EXTI_GetITStatus( EXTI_Line5 ) != RESET )
	{
		ret=IIC_RegRead( MMA845X_ADDR, INT_SOURCE_REG, &value1 );
		ret=IIC_RegRead( MMA845X_ADDR, PL_STATUS_REG, &value2 );
		ret=IIC_RegRead( MMA845X_ADDR, PULSE_SRC_REG, &value3 );
		if((value2&0x7F)<0x40)	/*有倾斜发生  0x8x 倾斜发生*/
		{
			mems_alarm_tick=5;	
			//rt_kprintf("\nv=%02x",value2);
		}
		else					/*0xcx 倾斜还原*/
		{


		}
		rt_kprintf("\nINT=%02x %02x %02x\n",value1,value2,value3);
		//rt_kprintf("\nINT=%02x\n",value2);
		EXTI_ClearITPendingBit( EXTI_Line5 );
	}
	rt_interrupt_leave( );
}

/*
   使用外部中断触发 PD5
 */

void EXTILine5_Config( void )
{
	GPIO_InitTypeDef	GPIO_InitStructure;
	NVIC_InitTypeDef	NVIC_InitStructure;
	EXTI_InitTypeDef	EXTI_InitStructure;

	/* Enable GPIOD clock */
	RCC_AHB1PeriphClockCmd( RCC_AHB1Periph_GPIOD, ENABLE );
	/* Enable SYSCFG clock */
	RCC_APB2PeriphClockCmd( RCC_APB2Periph_SYSCFG, ENABLE );

	/* Configure PD5 pin as input floating */
	GPIO_InitStructure.GPIO_Mode	= GPIO_Mode_IN;
	GPIO_InitStructure.GPIO_PuPd	= GPIO_PuPd_NOPULL;
	GPIO_InitStructure.GPIO_Pin		= GPIO_Pin_5;
	GPIO_Init( GPIOD, &GPIO_InitStructure );

	/* Connect EXTI Line5 to PD5 pin */
	SYSCFG_EXTILineConfig( EXTI_PortSourceGPIOD, EXTI_PinSource5 );

	/* Configure EXTI Line5 */
	EXTI_InitStructure.EXTI_Line	= EXTI_Line5;
	EXTI_InitStructure.EXTI_Mode	= EXTI_Mode_Interrupt;
	EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;
	EXTI_InitStructure.EXTI_LineCmd = ENABLE;
	EXTI_Init( &EXTI_InitStructure );

	/* Enable and set EXTI Line0 Interrupt to the lowest priority */
	NVIC_InitStructure.NVIC_IRQChannel						= EXTI9_5_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority	= 0x01;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority			= 0x01;
	NVIC_InitStructure.NVIC_IRQChannelCmd					= ENABLE;
	NVIC_Init( &NVIC_InitStructure );
}

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
static uint8_t mma8451_config( uint16_t param1, uint16_t param2 )
{
	extern uint8_t mems_status;
	unsigned char res, value;
	LCD_MSG lcdmsg;
	
	param_mma8451_word1=param1;
	param_mma8451_word2=param2;

	

/*启动配置*/
	if( IIC_RegWrite( MMA845X_ADDR, CTRL_REG1, ( CTRL_REG1_value & ~ACTIVE_MASK ) ) )
	{
		goto lbl_mma8451_config_err;
	}
	
	if( IIC_RegWrite( MMA845X_ADDR, XYZ_DATA_CFG_REG, FULL_SCALE_4G ) )
	{
		goto lbl_mma8451_config_err;
	}


/*设置水平垂直检测  Portrait/Landscape Detection.*/

	if( IIC_RegWrite( MMA845X_ADDR, PL_CFG_REG, 0x40 ) )
	{
		goto lbl_mma8451_config_err;
	}


	/*Step 4: Set the Back/Front Angle trip points in register 0x13 following the table in the data sheet.
	   NOTE: This register is readable in all versions of MMA845xQ but it is only modifiable in the MMA8451Q.
	   PL_BF_ZCOMP_Data = IIC_RegRead(0x13);
	   PL_BF_ZCOMP_Data& = 0x3F; //Clear bit 7 and 6
	   Select one of the following to set the B/F angle value:
	   PL_BF_ZCOMP_Data | = 0x00; //This does nothing additional and keeps bits [7:6] = 00
	   PL_BF_ZCOMP_Data | = 0x40; //Sets bits[7:6] = 01
	   PL_BF_ZCOMP_Data | = 0x80; //Sets bits[7:6] = 02
	   PL_BF_ZCOMP_Data | = 0xC0; //Sets bits[7:6] = 03
	   IIC_RegWrite(0x13, PL_BF_ZCOMP_Data); //Write in the updated Back/Front Angle

	   Step 5: Set the Z-Lockout angle trip point in register 0x13 following the table in the data sheet.
	   //NOTE: This register is readable in all versions of MMA845xQ but it is only modifiable in the MMA8451Q.
	   PL_BF_ZCOMP_Data = IIC_RegRead(0x1C); //Read out contents of the register (can be read by all
	   versions of MMA845xQ)
	   The remaining parts of this step only apply to MMA8451Q
	   PL_BF_ZCOMP_Data& = 0xF8; //Clear the last three bits of the register
	   Select one of the following to set the Z-lockout value
	   PL_BF_ZCOMP_Data | = 0x00; //This does nothing additional but the Z-lockout selection will remain at
	   14°
	   PL_BF_ZCOMP_Data | = 0x01; //Set the Z-lockout angle to 18°
	   PL_BF_ZCOMP_Data | = 0x02; //Set the Z-lockout angle to 21°
	   PL_BF_ZCOMP_Data | = 0x03; //Set the Z-lockout angle to 25°
	   PL_BF_ZCOMP_Data | = 0x04; //Set the Z-lockout angle to 29°
	   PL_BF_ZCOMP_Data | = 0x05; //Set the Z-lockout angle to 33°
	   PL_BF_ZCOMP_Data | = 0x06; //Set the Z-lockout angle to 37°
	   PL_BF_ZCOMP_Data | = 0x07; //Set the Z-lockout angle to 42°
	   IIC_RegWrite(0x13, PL_BF_ZCOMP_Data); //Write in the updated Z-lockout angle
	 */

/*
	if( IIC_RegWrite( MMA845X_ADDR, PL_BF_ZCOMP_REG, PL_BF_ZCOMP_REG_value ) )
	{
		goto lbl_mma8451_config_err;
	}
*/

	/*
	   Step 6: Set the Trip Threshold Angle
	   NOTE: This register is readable in all versions of MMA845xQ but it is only modifiable in the MMA8451Q.
	   Select the angle desired in the table, and, Enter in the values given in the table for the corresponding angle.
	   Refer to Figure 7 for the reference frame of the trip angles.
	   P_L_THS_Data = IIC_RegRead(0x14); (can be read by all versions of MMA845xQ)
	   The remaining parts of this step only apply to MMA8451Q
	   P_L_THS_Data& = 0x07; //Clear the Threshold values
	   Choose one of the following options
	   P_L_THS_Data | = (0x07)<<3; //Set Threshold to 15°
	   P_L_THS_Data | = (0x09)<<3; //Set Threshold to 20°
	   P_L_THS_Data | = (0x0C)<<3; //Set Threshold to 30°
	   P_L_THS_Data | = (0x0D)<<3; //Set Threshold to 35°
	   P_L_THS_Data | = (0x0F)<<3; //Set Threshold to 40°
	   P_L_THS_Data | = (0x10)<<3; //Set Threshold to 45°
	   P_L_THS_Data | = (0x13)<<3; //Set Threshold to 55°
	   P_L_THS_Data | = (0x14)<<3; //Set Threshold to 60°
	   P_L_THS_Data | = (0x17)<<3; //Set Threshold to 70°
	   P_L_THS_Data | = (0x19)<<3; //Set Threshold to 75°
	   IIC_RegWrite(0x14, P_L_THS_Data);

